private/quiz.org
#+TITLE: SWE 619 
#+OPTIONS: ^:nil toc:1

#+HTML_HEAD: <link rel="stylesheet" href="https://dynaroars.github.io/files/org.css">
#+HTML_HEAD: <link rel="alternative stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
* Quiz 1
# ** equal (the first equal implementation in in-class exercise 1)
#     - Give 2 inputs such that the results from the specs (Javadoc) and implementation agree 
#     - Give 2 inputs such that the results from the specs (Javadoc) and implementation disagree
Contracts for a Binary Search implementation. Specifiy the contracts/specifications for binary search implementation. Remember for precondition you want something as weak as possible and for postcondition as strong as possible.

#+begin_comment
Binary_search(arrays, x)
- precondition:
  - arrays: sorted, cannot null,
- postcondition:
  - if x not in arrays: raise some exception ...
  - ow: returns index of x in array
#+end_comment

* Quiz 2

Consider the following 2 specifications, the second of which has an associated implementation:
#+begin_src java
public static int minIndex (int [] a) {... implementation omitted ... }
   // EFFECTS: if a null throw NullPointerException, else if a.length=0 throw
   //      IllegalArgumentException else return index of some min element in a.

public static void setSmall (int [] a, int i) {
   // REQUIRES: a != null, 0 <= i < a.length
   // MODIFIES a
   // EFFECTS: rearranges elements in array a so that some smallest element is at index i
   int j = minIndex(a); int t = a[j]; a[j] = a[i]; a[i] = t;    }
#+end_src

1. Suppose we wish to transform the ~setSmall~ precondition ~a != null~ into defined behavior with an exception.
   1. What Java exception would Bloch recommend for this transformation?
      #+begin_comment
      Answer: NullPointerException.
      #+end_comment
   2. Rewrite the precondition and postcondition for ~setSmall()~ to achieve this result.
      #+begin_comment
         Answer: Note that the predicate a!=null is no longer in the REQUIRES clause.
         // REQUIRES: 0 <= i < a.length
         // MODIFIES a
         // EFFECTS: if a = null throw NullPointerException else
         //          rearranges elements in array a so that
         //          smallest element is at index i
      #+end_comment
   3. Does the given implementation of ~setSmall()~ satisfy this revised specification?
      #+begin_comment
      Answer: Yes. Note that the call to ~minIndex()~ generates the correct exception.
      #+end_comment
2. Suppose we wish, in addition, to transform the ~setSmall()~ precondition ~0 <= i < a.length~ into defined behavior with an exception.
   1. What exception would be recommended for this transformation? Hint: Note that ~i~ is described as an "index".
     #+begin_comment
     Answer: IndexOutOfBoundsException
     #+end_comment
   2. Extend your rewrite of the precondition and postcondition for ~setSmall()~ to achieve this result.
      #+begin_comment
      Answer: Note that the predicate 0 <= i < a.length is no longer in the REQUIRES clause.
      // MODIFIES a
      // EFFECTS: if a = null throw NullPointerException else
      //          if !(0 <= i < a.length) throw IndexOutOfBoundsException else
      //          rearranges elements in array a so that
      //          smallest element is at index i
      #+end_comment
   3. Does the given implementation of ~setSmall()~ satisfy this revised specification? Why? (Hint: it does not, and think about what exception raised in the specs vs. the implementation)
      #+begin_comment
      Answer: No. There are two cases. If the array is not empty, then the implementation returns ~IndexOutOfBoundsException~. However, if the array is empty, then the implementation generates ~IllegalArgumentException~ via the call to ~minIndex()~, which is /not/ ~IndexOutOfBoundsException~.
      #+end_comment


# * Quiz 3: Immutability
# *Immutatiblity*: Consider a partial version of Bloch's mutable Stack class:
#    #+begin_src java
#      public class Stack {

#          private Object[] elements;
#          private int size = 0;

#          public Stack() { this.elements = new Object[0]; }

#          public void push (Object e) {
#              ensureCapacity();      // implementation omitted from quiz
#              elements[size++] = e;
#          }

#          public Object pop () {
#              if (size == 0) throw new IllegalStateException("Stack.pop");
#              Object result = elements[--size];
#              elements[size] = null;
#              return result;
#          }
#      }

#    #+end_src
#    Also consider the following client interaction with Stack
#    #+begin_src java
#      Stack s = new Stack();
#      s.push("cat");
#      s.push("dog");
#      System.out.println(s.pop());
#    #+end_src
#      - What methods would be needed to convert the client interaction into an equivalent interaction with an immutable version called IStack? For each method, give *just the method header* - not the contract or implemetation.

   
#    #+begin_comment
#      public class IStack{
#      public IStack push(Object e){
#      // return new IStack() ....
#      }

#      public IStack pop (){
#      // return new IStack object
#      }

#      public Object top(){
#      // return the top of the stack
#      }

#      }
#    #+end_comment

