private/quiz.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-25 Mon 17:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>SWE 619</title>
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="alternative stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">SWE 619</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org91128d1">1. Quiz 1 (<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-31 Mon&gt;</span></span>)</a></li>
<li><a href="#orgde0d4fa">2. Quiz 2 (<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-02-07 Mon&gt;</span></span>)</a></li>
<li><a href="#org8a94629">3. Quiz 3: Immutability</a></li>
<li><a href="#org516fae8">4. Quiz 4: Immutable class</a></li>
<li><a href="#org4ea87da">5. Quiz 5:  Iterator</a></li>
<li><a href="#org176d481">6. Quiz 6:  Type</a></li>
<li><a href="#org8b5b210">7. Quiz 7:</a></li>
<li><a href="#orgcd9926e">8. Quiz 8:</a></li>
<li><a href="#org5ccfc20">9. Quiz 9:</a></li>
</ul>
</div>
</div>
<div id="outline-container-org91128d1" class="outline-2">
<h2 id="org91128d1"><span class="section-number-2">1.</span> Quiz 1 (<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-31 Mon&gt;</span></span>)</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-orgc4c2da3" class="outline-3">
<h3 id="orgc4c2da3"><span class="section-number-3">1.1.</span> Contracts for a Binary Search implementation.</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>specifiy the contracts/specifications for binary search implementation. Remember for precondition you want something as weak as possible and for postcondition as strong as possible.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgde0d4fa" class="outline-2">
<h2 id="orgde0d4fa"><span class="section-number-2">2.</span> Quiz 2 (<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-02-07 Mon&gt;</span></span>)</h2>
<div class="outline-text-2" id="text-2">
<p>
Consider the following 2 specifications, the second of which has an associated implementation:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">public</span> <span style="color: #e45649;">static</span> <span style="color: #986801;">int</span> <span style="color: #a626a4;">minIndex</span> (<span style="color: #986801;">int</span> [] <span style="color: #6a1868;">a</span>) {... implementation omitted ... }
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">EFFECTS: if a null throw NullPointerException, else if a.length=0 throw</span>
   <span style="color: #9ca0a4;">//      </span><span style="color: #9ca0a4;">IllegalArgumentException else return index of some min element in a.</span>
<span style="color: #e45649;">public</span> <span style="color: #e45649;">static</span> <span style="color: #986801;">void</span> <span style="color: #a626a4;">setSmall</span> (<span style="color: #986801;">int</span> [] <span style="color: #6a1868;">a</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">i</span>) {
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">REQUIRES: a != null, 0 &lt;= i &lt; a.length</span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">MODIFIES a</span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">EFFECTS: rearranges elements in array a so that some smallest element is at index i</span>
   <span style="color: #986801;">int</span> <span style="color: #6a1868;">j</span> = minIndex(a); <span style="color: #986801;">int</span> <span style="color: #6a1868;">t</span> = a[j]; a[j] = a[i]; a[i] = t;    }
</pre>
</div>

<ol class="org-ol">
<li>Suppose we wish to transform the <code>setSmall</code> precondition <code>a != null</code> into defined behavior with an exception.
<ol class="org-ol">
<li>What Java exception would Bloch recommend for this transformation?</li>
<li>Rewrite the precondition and postcondition for <code>setSmall()</code> to achieve this result.</li>
<li>Does the given implementation of <code>setSmall()</code> satisfy this revised specification?</li>
</ol></li>
<li>Suppose we wish, in addition, to transform the <code>setSmall()</code> precondition <code>0 &lt;= i &lt; a.length</code> into defined behavior with an exception.
<ol class="org-ol">
<li>What exception would Bloch recommend for this transformation? Hint: Note that <code>i</code> is described as an "index".</li>
<li>Extend your rewrite of the precondition and postcondition for <code>setSmall()</code> to achieve this result.</li>
<li>Does the given implementation of <code>setSmall()</code> satisfy this revised specification?</li>
</ol></li>
</ol>
</div>
</div>


<div id="outline-container-org8a94629" class="outline-2">
<h2 id="org8a94629"><span class="section-number-2">3.</span> Quiz 3: Immutability</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Immutatiblity</b>: Consider a partial version of Bloch's mutable Stack class:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">public</span> <span style="color: #e45649;">class</span> <span style="color: #986801;">Stack</span> {

    <span style="color: #e45649;">private</span> <span style="color: #986801;">Object</span>[] <span style="color: #6a1868;">elements</span>;
    <span style="color: #e45649;">private</span> <span style="color: #986801;">int</span> <span style="color: #6a1868;">size</span> = 0;

    <span style="color: #e45649;">public</span> Stack() { <span style="color: #e45649;">this</span>.elements = <span style="color: #e45649;">new</span> <span style="color: #986801;">Object</span>[0]; }

    <span style="color: #e45649;">public</span> <span style="color: #986801;">void</span> <span style="color: #a626a4;">push</span> (<span style="color: #986801;">Object</span> <span style="color: #6a1868;">e</span>) {
        ensureCapacity();      <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">implementation omitted from quiz</span>
        elements[size++] = e;
    }

    <span style="color: #e45649;">public</span> <span style="color: #986801;">Object</span> <span style="color: #a626a4;">pop</span> () {
        <span style="color: #e45649;">if</span> (size == 0) <span style="color: #e45649;">throw</span> <span style="color: #e45649;">new</span> <span style="color: #986801;">IllegalStateException</span>(<span style="color: #50a14f;">"Stack.pop"</span>);
        <span style="color: #986801;">Object</span> <span style="color: #6a1868;">result</span> = elements[--size];
        elements[size] = <span style="color: #b751b6;">null</span>;
        <span style="color: #e45649;">return</span> result;
    }
}

</pre>
</div>
<p>
Also consider the following client interaction with Stack
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #986801;">Stack</span> <span style="color: #6a1868;">s</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">Stack</span>();
s.push(<span style="color: #50a14f;">"cat"</span>);
s.push(<span style="color: #50a14f;">"dog"</span>);
System.out.println(s.pop());
</pre>
</div>
<ul class="org-ul">
<li>What methods would be needed to convert the client interaction into an equivalent interaction with an immutable version called IStack? For each method, give <b>just the method header</b> - not the contract or implemetation.</li>
</ul>
</div>
