private/quiz.org
** COMMENT Quiz 3: Verification using Hoare Logic
   Given the program
   #+begin_src java
     // {x <= 1}   # P1
     // {x <= 11}  # P2

     while (x != 10){
         x := x + 1;
     }

     //{x == 10}  # Q
   #+end_src
  
   1. Informally reason that this program is correct with the given =P1= and =Q=.
   1. This program *is correct* with respect to the given precondition =P1= and postcondition =Q=.  Prove it by finding a loop invariant and verify the verification condition (show your work, i.e., generate the =wp= and the =vc= of the program, and reason about these)
   2. Now, consider a different precondition =P2=.
      1. Recompute the VC of the program with respect to =P2=.
      1. is the VC  =P2 -> WP ..=  valid?  if yes, what does that mean,  if not, what does that mean?
      
# #+begin_comment
#    loop inv :  x <= 10

#    wp(while[x<=10](x != 10){x := x + 1;}, {x == 10}) =

#    //conj 1
#    I =
#    x <=10
   
#    //conj 2
#    (I & x!=10) => wp(x:= x+1, I)   =
#    (x <= 10 & x!=10) => wp(x:= x+1, x <= 10)
#    (x < 10) => x+1 <= 10
#    (x <= 9) => x <= 9
#    TRUE

#    //conj 3
#    (I & !(x!=10) => x == 10) =
#    (x <= 10 & !(x!=10) => x == 10)
#    x == 10 => x == 10
#    True

#    //vc
#    x<=10 => x<=10   #for P1,  this implication holds and thus shows the program is correct (wrt to Q and P1)

#    //x<=11 => x<=10   #for P2, this implication does not hold (cex x=11), and thus does not show anything other than that we cannot prove it. Important: fail to prove does not mean the program is wrong,  it simplify means we cannot prove it (could be because we picked a weak loop invariant,  could also be that the program is actually wrong)
# #+end_comment



*  Quiz 4: Immutable class
  
  1. Consider the following (supposedly) immutable class:

     #+begin_src java
       public final class Immutable {
           private final String string;
           private final int x;
           private final List<String> list;

           public Immutable(String string, int x, List<String> list) {
               this.string = string;                     // Line A
               this.x = x;                               // Line B
               this.list = new ArrayList<String> (list); // Line C
           }

           public String getString() { return string; }  // Line D
           public int getInt()    { return x; }       // Line E
           public List<String> getList() { return list; }    // Line F
       }
     #+end_src
    Which of the lines (A--F) has a problem wrt the immutability of class Immutable?
  2. For each of the above lines that has problem with immutability, write pseudocode code to demonstrate the issue

#     #+begin_comment
#      Only line F (because list is muttable)

#      List<String> list = //... supppose list is [cat, dog]
#      Immutable im = new Immutable("bat", 7, list);
#      list = im.getList();
#      list.add("elephant");   // now I've changed the internal state of Immutable
#                              // from
#                              // <bat, 7, [cat, dog]>
#                              // to
#                              // <bat, 7, [cat, dog, elephant]>
#     #+end_comment


* Quiz 5:  Iterator

The specification for Liskov's ~elements()~ method is given below.
- Note 1: A Liskov Iterator has only the the ~hasNext()~ and ~next()~ methods.

    #+begin_src java
     public Iterator elements()
     // EFFECTS: Returns a generator that will produce all the elements of
     //  this (as Integers), each exactly once, in arbitrary order.
     // REQUIRES: this must not be modified while the generator is in use


       #+end_src

Consider the code below which uses ~elements()~. Line numbers have been added for reference purposes.
  #+begin_src java
        0: IntSet s = new IntSet();

        1: s.insert(2);
        2: s.insert(8);
        3: Iterator itr = s.elements();
        4: itr.next();
        5: itr.next();
        6: // See questions below
        7: itr.next();

  #+end_src
	
- show the (stack) contents of ~itr~  after line 3
#+begin_comment
[2,8]  or [8,2]
#+end_comment
- show the contents of ~itr~  after line 5.
#+begin_comment
[]
#+end_comment
- If line 6 is ~s.insert(12)~; show the contents of ~itr~ after line 6?
#+begin_comment
Undefined behavior or violating the requirements of iteration
#+end_comment


