private/quiz.html

<div id="outline-container-org17ace6c" class="outline-3">
<h3 id="org17ace6c"><span class="section-number-3">3.1.</span> Quiz 4: Verification using Hoare Logic</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Given the program
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{x &lt;= 1}   # P1</span>
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{x &lt;= 11}  # P2</span>

<span style="color: #e45649;">while</span> (x != 10){
    <span style="color: #b751b6;">x</span> := x + 1;
}

<span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">{x == 10}  # Q</span>
</pre>
</div>

<ol class="org-ol">
<li>Informally reason that this program is correct with the given <code>P1</code> and <code>Q</code>.</li>
<li>This program <b>is correct</b> with respect to the given precondition <code>P1</code> and postcondition <code>Q</code>.  Prove it by finding a loop invariant and verify the verification condition (show your work, i.e., generate the <code>wp</code> and the <code>vc</code> of the program, and reason about these)</li>
<li>Now, consider a different precondition <code>P2</code>. 
<ol class="org-ol">
<li>Recompute the VC of the program with respect to <code>P2</code>.</li>
<li>is the VC  <code>P2 -&gt; WP ..</code>  valid?  if yes, what does that mean,  if not, what does that mean?</li>
</ol></li>
</ol>
</div>
</div>
</div>



<div id="outline-container-org516fae8" class="outline-2">
<h2 id="org516fae8"><span class="section-number-2">4.</span> Quiz 4: Immutable class</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><p>
Consider the following (supposedly) immutable class:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">public</span> <span style="color: #e45649;">final</span> <span style="color: #e45649;">class</span> <span style="color: #986801;">Immutable</span> { 
    <span style="color: #e45649;">private</span> <span style="color: #e45649;">final</span> <span style="color: #986801;">String</span> <span style="color: #6a1868;">string</span>;
    <span style="color: #e45649;">private</span> <span style="color: #e45649;">final</span> <span style="color: #986801;">int</span> <span style="color: #6a1868;">x</span>;
    <span style="color: #e45649;">private</span> <span style="color: #e45649;">final</span> <span style="color: #986801;">List</span>&lt;<span style="color: #986801;">String</span>&gt; <span style="color: #6a1868;">list</span>;

    <span style="color: #e45649;">public</span> Immutable(<span style="color: #986801;">String</span> <span style="color: #6a1868;">string</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">x</span>, <span style="color: #986801;">List</span>&lt;<span style="color: #986801;">String</span>&gt; <span style="color: #6a1868;">list</span>) {
        <span style="color: #e45649;">this</span>.string = string;                     <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Line A</span>
        <span style="color: #e45649;">this</span>.x = x;                               <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Line B</span>
        <span style="color: #e45649;">this</span>.list = <span style="color: #e45649;">new</span> <span style="color: #986801;">ArrayList</span>&lt;<span style="color: #986801;">String</span>&gt; (list); <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Line C</span>
    }

    <span style="color: #e45649;">public</span> <span style="color: #986801;">String</span> <span style="color: #a626a4;">getString</span>() { <span style="color: #e45649;">return</span> string; }  <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Line D</span>
    <span style="color: #e45649;">public</span> <span style="color: #986801;">int</span> <span style="color: #a626a4;">getInt</span>()    { <span style="color: #e45649;">return</span> x; }       <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Line E</span>
    <span style="color: #e45649;">public</span> <span style="color: #986801;">List</span>&lt;<span style="color: #986801;">String</span>&gt; <span style="color: #a626a4;">getList</span>() { <span style="color: #e45649;">return</span> list; }    <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Line F</span>
}
</pre>
</div>
<p>
Which of the lines (A&#x2013;F) has a problem wrt the immutability of class Immutable?
</p></li>
<li>For each of the above lines that has problem with immutability, write pseudocode code to demonstrate the issue</li>
</ol>
</div>
</div>


<div id="outline-container-org4ea87da" class="outline-2">
<h2 id="org4ea87da"><span class="section-number-2">5.</span> Quiz 5:  Iterator</h2>
<div class="outline-text-2" id="text-5">
<p>
The specification for Liskov's <code>elements()</code> method is given below. 
</p>
<ul class="org-ul">
<li>Note 1: A Liskov Iterator has only the the <code>hasNext()</code> and <code>next()</code> methods.</li>
<li><p>
Note 2: As discussed in class the abstract state for such an <code>Iterator</code> is a <code>Stack</code> of objects yet to be produced.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">public</span> <span style="color: #986801;">Iterator</span> <span style="color: #a626a4;">elements</span>() 
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">EFFECTS: Returns a generator that will produce all the elements of</span>
<span style="color: #9ca0a4;">//  </span><span style="color: #9ca0a4;">this (as Integers), each exactly once, in arbitrary order.</span>
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">REQUIRES: this must not be modified while the generator is in use</span>


</pre>
</div></li>
</ul>

<p>
Consider the code below which uses <code>elements()</code>. Line numbers have been added for reference purposes.
</p>
<div class="org-src-container">
<pre class="src src-java">0: IntSet s = <span style="color: #e45649;">new</span> <span style="color: #986801;">IntSet</span>(); 

1: s.insert(2);
2: s.insert(8);
3: Iterator itr = s.elements();   
4: itr.next();                    
5: itr.next();                    
6: <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">See questions below</span>
7: itr.next();                   

</pre>
</div>

<ul class="org-ul">
<li>show the (stack) contents of <code>itr</code>  after line 3</li>
</ul>

<ul class="org-ul">
<li>show the contents of <code>itr</code>  after line 5.</li>
</ul>

<ul class="org-ul">
<li>If line 6 is <code>s.insert(12)</code>; show the contents of <code>itr</code> after line 6?</li>
</ul>
</div>
</div>
