private/quiz.org
* Quiz 6:  Type

  #+begin_src java
 class A {
    public Iterator compose (Iterator itr)
    // Requires: itr is not null
    // Modifies: itr
    // Effects: if this is not appropriate for itr throw IAE
    // else return generator of itr composed with this
 class B {
    public Iterator compose (Iterator itr)
    // Modifies: itr
    // Effects: if itr is null throw NPE
    // else if this is not appropriate for itr throw IAE
    // else return generator of itr composed with this
 class C {
    public Iterator compose (Iterator itr)
    // Modifies: itr
    // Effects: if itr is null return iterator equal to this
    // else if this is not appropriate for itr throw IAE
    // else return generator of itr composed with this
   #+end_src

 Analyze the =compose()= method in each of these cases according to Liskov's Principle of Substitution. For each case, state if the precondition and the postcondition parts are satisfied or fail, and *justify*.

 1. B extends A.
 1. C extends A.
 1. A extends B.
 1. C extends B.
 1. B extends C.

#+begin_comment
1. B extends A.
Precondition Part:
Answer: Satisfied: weaker precondition in B
Postcondition Part:
Answer: Satisfied: Identical behavior where A defined, with additional behavior where A not defined.
2.C extends A.
Precondition Part:
Answer: Satisfied: weaker precondition in C
Postcondition Part:
Answer: Satisfied: Identical behavior where A defined, with additional behavior where A not defined.
3. A extends B.
Precondition Part:
Answer: Not satisfied: stronger precondition in A
Postcondition Part:
Answer: No analysis required
4. C extends B.
Precondition Part:
Answer: Satisfied: same preconditions
Postcondition Part:
Answer A: Not satisfied: Inconsistent behavior in case where itr is null
Answer B: Satisfied, stronger post (assuming returning a an iterator equal to this)
5. B extends C.
Precondition Part:
Answer: Satisfied: same preconditions
Postcondition Part:
Answer: Not satisfied: Inconsistent behavior in case where itr is null
#+end_comment

* Quiz 7:

  #+begin_src java
    Set<String> t = //  See questions below

    t.add("antelope");
    t.add("dog");
    t.add("cat");

 // t.toString() is ???
  #+end_src


1. Suppose ~t~ is instantiated as ~Set<String> t = new TreeSet<String>();~.  At the end of the computation, what is ~t.toString()?~
  #+begin_comment
  Answer: [antelope, cat, dog]
  #+end_comment
2. Suppose ~t~ is instantiated as ~Set<String> t = new TreeSet<String>((x,y) -> x.length() - y.length());~. At the end of the computation, what is ~t.toString()?~
  #+begin_comment
  Answer: [dog, antelope]
  #+end_comment

# # 3. Suppose ~t~ is instantiated as ~Set<String> t = new TreeSet<String>((x,y) -> y.compareTo(x));~. At the end of the computation, what is ~t.toString()?~
# # #+begin_comment
# # Answer: [dog, cat, antelope]
# # #+end_comment

# # 4. Which of the above ~Comparator~ implementations is problematic? and why?
# # #+begin_comment
# # Answer: 2, compare(a,b)  is not consistent with a.equals(b).
# # #+end_comment


* Quiz 8:
Consider the following code:
#+begin_src java
public class Example <E> {
    String           string = "ant";
    Integer          seven = 7;
    E                e = null;
    Object[]         objects;
    List < Object >  listObject;
    List < E >       listE;
    public void m() {
          // Java code for questions appears here
    }
}
#+end_src

Independently consider the following 5 sequences of Java instructions. For each sequence, what of the following choices will happen ? (i) compiler warning; (ii) compiler error; (iii) runtime exception; or (iv) normal run

-
#+begin_src java
objects = new E[1];
objects[0] = e;
#+end_src
#+begin_comment
Answer: compiler error
#+end_comment

-
#+begin_src java
listE = new ArrayList < E >();
listE.add(e);
listObject = listE;
#+end_src
#+begin_comment
Answer: compiler error
#+end_comment


-
#+begin_src java
listObject = new ArrayList < String >();
listObject.add(string) ;
listObject.add(seven) ;
#+end_src
#+begin_comment
Answer: compiler error
#+end_comment


-
#+begin_src java
objects = new Object[1];
objects[0] = string;
objects[0] = seven;
#+end_src
#+begin_comment
Answer: normal run
#+end_comment


-
#+begin_src java
objects = new String[1];
objects[0] = string;
objects[0] = seven;
#+end_src
#+begin_comment
Answer: runtime exception
#+end_comment



