private/quiz.html


<div id="outline-container-org176d481" class="outline-2">
<h2 id="org176d481"><span class="section-number-2">6.</span> Quiz 6:  Type</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">class</span> <span style="color: #986801;">A</span> {
   <span style="color: #e45649;">public</span> <span style="color: #986801;">Iterator</span> <span style="color: #a626a4;">compose</span> (<span style="color: #986801;">Iterator</span> <span style="color: #6a1868;">itr</span>)
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Requires: itr is not null</span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Modifies: itr</span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Effects: if this is not appropriate for itr throw IAE</span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">else return generator of itr composed with this</span>
<span style="color: #e45649;">class</span> B {
   <span style="color: #e45649;">public</span> <span style="color: #986801;">Iterator</span> <span style="color: #a626a4;">compose</span> (<span style="color: #986801;">Iterator</span> <span style="color: #6a1868;">itr</span>)
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Modifies: itr</span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Effects: if itr is null throw NPE </span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">else if this is not appropriate for itr throw IAE</span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">else return generator of itr composed with this</span>
<span style="color: #e45649;">class</span> C {
   <span style="color: #e45649;">public</span> <span style="color: #986801;">Iterator</span> <span style="color: #a626a4;">compose</span> (<span style="color: #986801;">Iterator</span> <span style="color: #6a1868;">itr</span>)
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Modifies: itr</span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Effects: if itr is null return iterator equal to this</span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">else if this is not appropriate for itr throw IAE</span>
   <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">else return generator of itr composed with this</span>
</pre>
</div>

<p>
Analyze the <code>compose()</code> method in each of these cases according to Liskove's Principle of Substitution. For each case, state if the precondition and the postcondition parts are satisfied or fail, and <b>justify</b>.
</p>

<ol class="org-ol">
<li>B extends A.</li>
<li>C extends A.</li>
<li>A extends B.</li>
<li>C extends B.</li>
<li>B extends C.</li>
</ol>
</div>
</div>

<div id="outline-container-org8b5b210" class="outline-2">
<h2 id="org8b5b210"><span class="section-number-2">7.</span> Quiz 7:</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-java">   <span style="color: #986801;">Set</span>&lt;<span style="color: #986801;">String</span>&gt; <span style="color: #6a1868;">t</span> = <span style="color: #9ca0a4;">//  </span><span style="color: #9ca0a4;">See questions below</span>

   t.add(<span style="color: #50a14f;">"antelope"</span>);
   t.add(<span style="color: #50a14f;">"dog"</span>);
   t.add(<span style="color: #50a14f;">"cat"</span>);

<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">t.toString() is ???</span>
</pre>
</div>


<ol class="org-ol">
<li>Suppose <code>t</code> is instantiated as <code>Set&lt;String&gt; t = new TreeSet&lt;String&gt;();</code>.  At the end of the computation, what is <code>t.toString()?</code></li>
<li>Suppose <code>t</code> is instantiated as <code>Set&lt;String&gt; t = new TreeSet&lt;String&gt;((x,y) -&gt; x.length() - y.length());</code>. At the end of the computation, what is <code>t.toString()?</code></li>
</ol>
</div>
</div>


<div id="outline-container-orgcd9926e" class="outline-2">
<h2 id="orgcd9926e"><span class="section-number-2">8.</span> Quiz 8:</h2>
<div class="outline-text-2" id="text-8">
<p>
Consider the following code:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">public</span> <span style="color: #e45649;">class</span> <span style="color: #986801;">Example</span> &lt;<span style="color: #986801;">E</span>&gt; {
    <span style="color: #986801;">String</span>           <span style="color: #6a1868;">string</span> = <span style="color: #50a14f;">"ant"</span>;
    <span style="color: #986801;">Integer</span>          <span style="color: #6a1868;">seven</span> = 7;
    <span style="color: #986801;">E</span>                <span style="color: #6a1868;">e</span> = <span style="color: #b751b6;">null</span>;
    <span style="color: #986801;">Object</span>[]         <span style="color: #6a1868;">objects</span>;
    <span style="color: #986801;">List</span> &lt; <span style="color: #986801;">Object</span> &gt;  <span style="color: #6a1868;">listObject</span>;
    <span style="color: #986801;">List</span> &lt; <span style="color: #986801;">E</span> &gt;       <span style="color: #6a1868;">listE</span>;
    <span style="color: #e45649;">public</span> <span style="color: #986801;">void</span> <span style="color: #a626a4;">m</span>() {
          <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Java code for questions appears here</span>
    }
}
</pre>
</div>

<p>
Independently consider the following 5 sequences of Java instructions. For each sequence, what of the following choices will happen ? (i) compiler warning; (ii) compiler error; (iii) runtime exception; or (iv) normal run
</p>

<ul class="org-ul">
<li></li>
</ul>
<div class="org-src-container">
<pre class="src src-java">objects = <span style="color: #e45649;">new</span> <span style="color: #986801;">E</span>[1];
objects[0] = e;
</pre>
</div>

<ul class="org-ul">
<li></li>
</ul>
<div class="org-src-container">
<pre class="src src-java">listE = <span style="color: #e45649;">new</span> <span style="color: #986801;">ArrayList</span> &lt; <span style="color: #986801;">E</span> &gt;();
listE.add(e);
listObject = listE;
</pre>
</div>


<ul class="org-ul">
<li></li>
</ul>
<div class="org-src-container">
<pre class="src src-java">listObject = <span style="color: #e45649;">new</span> <span style="color: #986801;">ArrayList</span> &lt; <span style="color: #986801;">String</span> &gt;();
listObject.add(string) ;
listObject.add(seven) ;
</pre>
</div>


<ul class="org-ul">
<li></li>
</ul>
<div class="org-src-container">
<pre class="src src-java">objects = <span style="color: #e45649;">new</span> <span style="color: #986801;">Object</span>[1];
objects[0] = string;
objects[0] = seven;
</pre>
</div>


<ul class="org-ul">
<li></li>
</ul>
<div class="org-src-container">
<pre class="src src-java">objects = <span style="color: #e45649;">new</span> <span style="color: #986801;">String</span>[1];
objects[0] = string;
objects[0] = seven;
</pre>
</div>
</div>
</div>
