private/quiz.html

<div id="outline-container-org5ccfc20" class="outline-2">
<h2 id="org5ccfc20"><span class="section-number-2">9.</span> Quiz 9:</h2>
<div class="outline-text-2" id="text-9">
<p>
Consider the following code.  
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">class</span> <span style="color: #986801;">Apple</span> {
  <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">rep-inv:  name != null</span>
  <span style="color: #e45649;">private</span> <span style="color: #986801;">String</span> <span style="color: #6a1868;">name</span>;
  <span style="color: #e45649;">public</span> Apple (<span style="color: #986801;">String</span> <span style="color: #6a1868;">name</span>) {   
     <span style="color: #e45649;">if</span> (name == <span style="color: #b751b6;">null</span>) <span style="color: #e45649;">throw</span> <span style="color: #e45649;">new</span> <span style="color: #986801;">NPE</span>(...);
     <span style="color: #e45649;">this</span>.name = name;
  }
  <span style="color: #b751b6;">@Override</span> <span style="color: #e45649;">public</span> <span style="color: #986801;">boolean</span> <span style="color: #a626a4;">equals</span> (<span style="color: #986801;">Object</span> <span style="color: #6a1868;">o</span>) {
     <span style="color: #e45649;">if</span> (<span style="color: #4078f2; font-weight: bold;">!</span>(o <span style="color: #e45649;">instanceof</span> Apple)) { <span style="color: #e45649;">return</span> <span style="color: #b751b6;">false</span>; }
     <span style="color: #986801;">Apple</span> <span style="color: #6a1868;">a</span> = (<span style="color: #986801;">Apple</span>) o;     
     <span style="color: #e45649;">return</span> name.equals(a.name);
  }
  <span style="color: #b751b6;">@Override</span> <span style="color: #e45649;">public</span> <span style="color: #986801;">int</span> <span style="color: #a626a4;">hashCode</span>() { <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">see questions below }</span>
  <span style="color: #b751b6;">@Override</span> <span style="color: #e45649;">public</span> <span style="color: #986801;">String</span> <span style="color: #a626a4;">toString</span>() { <span style="color: #e45649;">return</span> name; }
}
<span style="color: #e45649;">class</span> <span style="color: #986801;">AppleTracker</span> <span style="color: #e45649;">extends</span> <span style="color: #986801;">Apple</span> {
  <span style="color: #e45649;">private</span> <span style="color: #e45649;">static</span> <span style="color: #986801;">Set</span>&lt;<span style="color: #986801;">String</span>&gt; <span style="color: #6a1868;">inventory</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">HashSet</span>&lt;<span style="color: #986801;">String</span>&gt; ();
  <span style="color: #e45649;">public</span> AppleTracker (<span style="color: #986801;">String</span> <span style="color: #6a1868;">name</span>) { <span style="color: #e45649;">super</span>(name); inventory.add(name);}
  <span style="color: #e45649;">public</span> <span style="color: #e45649;">static</span> <span style="color: #986801;">Set</span>&lt;<span style="color: #986801;">String</span>&gt; <span style="color: #a626a4;">getInventory</span>() { <span style="color: #e45649;">return</span> Collections.unmodifiableSet(inventory);}
}
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">client code</span>
<span style="color: #986801;">Apple</span> <span style="color: #6a1868;">a</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">Apple</span>(<span style="color: #50a14f;">"Winesap"</span>);
<span style="color: #986801;">AppleTracker</span> <span style="color: #6a1868;">at1</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">AppleTracker</span>(<span style="color: #50a14f;">"Winesap"</span>);
<span style="color: #986801;">AppleTracker</span> <span style="color: #6a1868;">at2</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">AppleTracker</span>(<span style="color: #50a14f;">"Fuji"</span>);

</pre>
</div>

<p>
Mark each of the following either <b>True</b> or <b>False</b>:
</p>

<ol class="org-ol">
<li>The <code>equals()</code> method in the AppleTracker class is inherited from the Apple class.</li>
<li><code>a.equals(at1)</code> sometimes returns true and sometimes returns false.</li>
<li>The <code>equals()</code> method in the Apple class relies on the rep-invariant to satisfy its contract.</li>
<li><code>AppleTracker</code> adds client-visible state to Apple objects.</li>
<li><code>a.equals(at1)</code> and <code>at1.equals(a)</code> are both true.</li>
<li><code>a.equals(at2)</code> and <code>at2.equals(a)</code> are both false.</li>
<li><code>at1.equals(a)</code> and <code>a.equals(at2)</code> are both true, but <code>at1.equals(at2)</code> is false.</li>
<li>It would correct to implement <code>hashCode()</code> as <code>return name.hashCode();</code></li>
<li>It would correct to inherit <code>hashCode()</code> from the Object class.</li>
<li>Bloch would object to replacing <code>o instanceof Apple</code> with a predicate built atop <code>getClass()</code>.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
